In [44]:
#import dependencies
import pandas as pd
from sqlalchemy import create_engine
import numpy as np
import csv
import io
import requests
import pymysql
pymysql.install_as_MySQLdb()
import mysql.connector

### Extract CSVs into DataFrames

#### CSV source file from Kaggle with Airline name and IATA Code

In [2]:
airlines_code = "../Resources/airlines_code.csv"
airlines_code_df = pd.read_csv(airlines_code)
airlines_code_df

   IATA_CODE                       AIRLINE
0         UA         United Air Lines Inc.
1         AA        American Airlines Inc.
2         US               US Airways Inc.
3         F9        Frontier Airlines Inc.
4         B6               JetBlue Airways
5         OO         Skywest Airlines Inc.
6         AS          Alaska Airlines Inc.
7         NK              Spirit Air Lines
8         WN        Southwest Airlines Co.
9         DL          Delta Air Lines Inc.
10        EV   Atlantic Southeast Airlines
11        HA        Hawaiian Airlines Inc.
12        MQ  American Eagle Airlines Inc.
13        VX                Virgin America

#### #CSV source from Kaggle gives the details about the number of delays during departure and arrival

In [3]:
airlines_delay = "../Resources/airlines_delay.csv"
airlines_delay_df = pd.read_csv(airlines_delay)
airlines_delay_df.head()

C:\Users\goksadas\AppData\Local\Continuum\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3020: DtypeWarning: Columns (7,8) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAIL_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,...,ARRIVAL_TIME,ARRIVAL_DELAY,DIVERTED,CANCELLED,CANCELLATION_REASON,AIR_SYSTEM_DELAY,SECURITY_DELAY,AIRLINE_DELAY,LATE_AIRCRAFT_DELAY,WEATHER_DELAY
0,2015,1,1,4,AS,98,N407AS,ANC,SEA,5,...,408.0,-22.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
1,2015,1,1,4,AA,2336,N3KUAA,LAX,PBI,10,...,741.0,-9.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
2,2015,1,1,4,US,840,N171US,SFO,CLT,20,...,811.0,5.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
3,2015,1,1,4,AA,258,N3HYAA,LAX,MIA,20,...,756.0,-9.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,2015,1,1,4,AS,135,N527AS,SEA,ANC,25,...,259.0,-21.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
#Create a new df with only the required fields
new_airlines_delay_df = airlines_delay_df[['YEAR', 'AIRLINE', 'DEPARTURE_DELAY','ARRIVAL_DELAY']].copy()
new_airlines_delay_df.head()

   YEAR AIRLINE  DEPARTURE_DELAY  ARRIVAL_DELAY
0  2015      AS            -11.0          -22.0
1  2015      AA             -8.0           -9.0
2  2015      US             -2.0            5.0
3  2015      AA             -5.0           -9.0
4  2015      AS             -1.0          -21.0

In [12]:
#Checking arrival delays
new_airlines_delay_df['ARRIVAL_DELAY_COUNT'] = np.where(new_airlines_delay_df['ARRIVAL_DELAY']>0, 1, 0)

In [13]:
#Checking departure delays
new_airlines_delay_df['DEPARTURE_DELAY_COUNT'] = np.where(new_airlines_delay_df['DEPARTURE_DELAY']<0, 0, 1)

In [14]:
#Calculate total number of Arrival and Departure delays by Airlines
airlines_delay_count_df = new_airlines_delay_df.groupby(['AIRLINE']).sum()
new_airlines_delay_count_df = airlines_delay_count_df.reset_index()
new_airlines_delay_count_df.head()

,AIRLINE,YEAR,DEPARTURE_DELAY,ARRIVAL_DELAY,ARRIVAL_DELAY_COUNT,DEPARTURE_DELAY_COUNT
0,AA,1462857760,6369435.0,2460604.0,252191,289945
1,AS,347629815,306997.0,-167421.0,56953,51268
2,B6,538101720,3026467.0,1749880.0,101998,119888
3,DL,1764900215,6427294.0,162527.0,250840,353300
4,EV,1152533655,4857338.0,3653252.0,213217,206384

In [15]:
#Rename column
new_airlines_delay_count_df = new_airlines_delay_count_df.rename(columns={"AIRLINE": "IATA_CODE"})
new_airlines_delay_count_df

,IATA_CODE,YEAR,DEPARTURE_DELAY,ARRIVAL_DELAY,ARRIVAL_DELAY_COUNT,DEPARTURE_DELAY_COUNT
0,AA,1462857760,6369435.0,2460604.0,252191,289945
1,AS,347629815,306997.0,-167421.0,56953,51268
2,B6,538101720,3026467.0,1749880.0,101998,119888
3,DL,1764900215,6427294.0,162527.0,250840,353300
4,EV,1152533655,4857338.0,3653252.0,213217,206384
5,F9,183034540,1205449.0,1126549.0,41232,38692
6,HA,153688080,36972.0,153838.0,30179,23431
7,MQ,593683480,2837908.0,1800397.0,103505,123120
8,NK,236518685,1840887.0,1667050.0,56887,58716
9,OO,1185531295,4517510.0,3371854.0,222435,207983
10,UA,1039181845,7355348.0,2757957.0,186227,290869
11,US,400410725,1196447.0,719831.0,76285,75683
12,VX,124734545,553852.0,290175.0,24180,27780
13,WN,2542637825,13186520.0,5435468.0,470767,674072

In [16]:
#Cleaning and extract only required columns
final_airlines_delay_count_df = new_airlines_delay_count_df[['IATA_CODE','DEPARTURE_DELAY_COUNT','ARRIVAL_DELAY_COUNT']]
final_airlines_delay_count_df

   IATA_CODE  DEPARTURE_DELAY_COUNT  ARRIVAL_DELAY_COUNT
0         AA                 289945               252191
1         AS                  51268                56953
2         B6                 119888               101998
3         DL                 353300               250840
4         EV                 206384               213217
5         F9                  38692                41232
6         HA                  23431                30179
7         MQ                 123120               103505
8         NK                  58716                56887
9         OO                 207983               222435
10        UA                 290869               186227
11        US                  75683                76285
12        VX                  27780                24180
13        WN                 674072               470767

#### #CSV source from Aviation-Safety.net gives the number of incident by Airlines

In [ ]:
airline_safety = "../Resources/airline_safety.csv"
airline_safety_df = pd.read_csv(airline_safety)

In [17]:
#Cleaning of data
airline_safety_df = airline_safety_df.dropna().reset_index(drop=True)
airline_safety_df.head()

,airline,IATA_Code,avail_seat_km_per_week,incidents_85_99,fatal_accidents_85_99,fatalities_85_99,incidents_00_14,fatal_accidents_00_14,fatalities_00_14
0,Alaska Airlines*,AS,965346773,5,0,0,5,1,88
1,American*,AA,5228357340,21,5,101,17,3,416
2,Delta / Northwest*,DL,6525658894,24,12,407,24,2,51
3,Hawaiian Airlines,HA,493877795,0,0,0,1,0,0
4,Southwest Airlines,WN,3276525770,1,0,0,8,0,0

In [18]:
#Calculate Total incidents per Airline
airline_safety_df['TOTAL_INCIDENTS'] = airline_safety_df['incidents_85_99'] + airline_safety_df['incidents_00_14']
airline_safety_df

,airline,IATA_Code,avail_seat_km_per_week,incidents_85_99,fatal_accidents_85_99,fatalities_85_99,incidents_00_14,fatal_accidents_00_14,fatalities_00_14,TOTAL_INCIDENTS
0,Alaska Airlines*,AS,965346773,5,0,0,5,1,88,10
1,American*,AA,5228357340,21,5,101,17,3,416,38
2,Delta / Northwest*,DL,6525658894,24,12,407,24,2,51,48
3,Hawaiian Airlines,HA,493877795,0,0,0,1,0,0,1
4,Southwest Airlines,WN,3276525770,1,0,0,8,0,0,9
5,United / Continental*,UA,7139291291,19,8,319,14,2,109,33
6,US Airways / America West*,US,2455687887,16,7,224,11,2,23,27
7,Virgin Atlantic,VX,1005248585,1,0,0,0,0,0,1

In [19]:
#Cleanup of data
new_airline_safety_df = airline_safety_df[['airline','IATA_Code','TOTAL_INCIDENTS']].copy()
new_airline_safety_df = new_airline_safety_df.rename(columns={"IATA_Code": "IATA_CODE"})
new_airline_safety_df

                      airline IATA_CODE  TOTAL_INCIDENTS
0            Alaska Airlines*        AS               10
1                   American*        AA               38
2          Delta / Northwest*        DL               48
3           Hawaiian Airlines        HA                1
4          Southwest Airlines        WN                9
5       United / Continental*        UA               33
6  US Airways / America West*        US               27
7             Virgin Atlantic        VX                1

In [20]:
#Extract only the required columns
final_new_airline_safety_df = new_airline_safety_df[['IATA_CODE','TOTAL_INCIDENTS']]
final_new_airline_safety_df

  IATA_CODE  TOTAL_INCIDENTS
0        AS               10
1        AA               38
2        DL               48
3        HA                1
4        WN                9
5        UA               33
6        US               27
7        VX                1

#### #CSV source from data.world containing number of passengers travelled per Airline

In [21]:
airlines_pass_stats = "../Resources/airlines_pass_stats.csv"
airlines_pass_stats_df = pd.read_csv(airlines_pass_stats)
airlines_pass_stats_df.head()

,Activity Period,Operating Airline,Operating Airline IATA Code,Published Airline,Published Airline IATA Code,GEO Summary,GEO Region,Activity Type Code,Price Category Code,Terminal,Boarding Area,Passenger Count
0,201809,Air New Zealand,NZ,Air New Zealand,NZ,International,Australia / Oceania,Deplaned,Other,International,G,9096
1,201809,United Airlines,UA,United Airlines,UA,International,Europe,Deplaned,Other,International,G,51264
2,201809,United Airlines,UA,United Airlines,UA,International,Canada,Deplaned,Other,Terminal 3,E,10438
3,201809,China Eastern,MU,China Eastern,MU,International,Asia,Deplaned,Other,International,A,10180
4,201809,Volaris Airlines,Y4,Volaris Airlines,Y4,International,Mexico,Enplaned,Low Fare,International,A,2086

In [53]:
#Cleanup and calculations
new_airlines_pass_stats_df = airlines_pass_stats_df.groupby(['Operating Airline IATA Code']).sum()
new_airlines_pass_stats_df = new_airlines_pass_stats_df.reset_index()
new_airlines_pass_stats_df = new_airlines_pass_stats_df.rename(columns={"Operating Airline IATA Code": "IATA_CODE"})
new_airlines_pass_stats_df.head()

  IATA_CODE  Activity Period  Passenger Count
0        4O          2825284            31159
1        4T          3209124             5002
2        5Y           402618               68
3        9W          3213128            68485
4        A8          4415247              110

In [23]:
#Extract only the required columns
final_new_airlines_pass_stats_df = new_airlines_pass_stats_df[['IATA_CODE','Passenger Count']]
final_new_airlines_pass_stats_df.head()

  IATA_CODE  Passenger Count
0        4O            31159
1        4T             5002
2        5Y               68
3        9W            68485
4        A8              110

### Transform Airlines DataFrame merged together based on common key (IATA Code)

In [50]:
# Create a transformed dataframe with clean data
airlines_transformed_df = airlines_code_df.merge(final_airlines_delay_count_df,on='IATA_CODE').merge(final_new_airline_safety_df,on='IATA_CODE').merge(final_new_airlines_pass_stats_df,on='IATA_CODE')
airlines_transformed_df = airlines_transformed_df.rename(columns={"DEPARTURE_DELAY_COUNT": "DEPARTURE_DELAYS", 
                                                                  "ARRIVAL_DELAY_COUNT": "ARRIVAL_DELAYS",
                                                                  "Passenger Count": "PASSENGERS_TRAVELLED"})
airlines_transformed_df

,IATA_CODE,AIRLINE,DEPARTURE_DELAYS,ARRIVAL_DELAYS,TOTAL_INCIDENTS,PASSENGERS_TRAVELLED
0,UA,United Air Lines Inc.,290869,186227,33,224380590
1,AA,American Airlines Inc.,289945,252191,38,44650403
2,US,US Airways Inc.,75683,76285,27,16816616
3,AS,Alaska Airlines Inc.,51268,56953,10,19199981
4,WN,Southwest Airlines Co.,674072,470767,9,34406223
5,DL,Delta Air Lines Inc.,353300,250840,48,36108365
6,HA,Hawaiian Airlines Inc.,23431,30179,1,3086872
7,VX,Virgin America,27780,24180,1,37843920

### Create database connection

In [42]:
#Create mysql db connection
connection_string = "root:root@127.0.0.1/ETL_PROJECT"
engine = create_engine(f'mysql://root:etlproject@127.0.0.1/ETL_PROJECT')

In [43]:
# Confirm tables -- us_airlines_stats
engine.table_names()

['us_airlines_stats']

### Load DataFrames into database

In [51]:
airlines_transformed_df.to_sql(name='us_airlines_stats', con=engine, if_exists='append', index=False)

In [52]:
#Reading the data from the us_airlines_stats mysql database
sql = "select * from us_airlines_stats"
output_df = pd.read_sql(sql, engine)

#Display the results
output_df

,IATA_CODE,AIRLINE,DEPARTURE_DELAYS,ARRIVAL_DELAYS,TOTAL_INCIDENTS,PASSENGERS_TRAVELLED
0,UA,United Air Lines Inc.,290869,186227,33,224380590
1,AA,American Airlines Inc.,289945,252191,38,44650403
2,US,US Airways Inc.,75683,76285,27,16816616
3,AS,Alaska Airlines Inc.,51268,56953,10,19199981
4,WN,Southwest Airlines Co.,674072,470767,9,34406223
5,DL,Delta Air Lines Inc.,353300,250840,48,36108365
6,HA,Hawaiian Airlines Inc.,23431,30179,1,3086872
7,VX,Virgin America,27780,24180,1,37843920